import React from 'react';

const Blogs = () => {
    return (
      <div className="w-75 mx-auto my-5">
        <h2>#1 জাভাস্ক্রিপ্ট এবং নোড জে এস এর মধ্যে পার্থক্য কি?</h2>
        <p className="mb-3">
          <strong>জাভাস্ক্রিপ্ট </strong> <br /> জাভাস্ক্রিপ্ট হল একটা
          স্ক্রিপ্টিং ল্যঙ্গুয়েজ যা ব্রাউজার ছাড়া রান করানো যায় না । এইচটিএমএল
          ওয়েব পেজ কে ডায়ানামিক রুপ দিতে জাভাস্ক্রিপ্ট একটি গুরুত্বপুর্ণ ভুমিকা
          পালন করে । যেহেতু জাভাস্ক্রিপ্ট ব্রাউজারে রান করে তাই এটার সবচেয়ে বড়ো
          সুবিধা হল যে এটা যেকোনো ওপারেটিং সিস্টেমে চলতে পারে কারন আমরা জানি যে
          যেকোনো অপারেটিং সিস্টেমে আর যাই থাকুক বা না থাকুক অন্তত একটা ব্রাউজার
          থাকবেই । জাভাস্ক্রিপ্ট সম্পুর্ন ক্লায়েন্ট সাইড ল্যঙ্গুয়েজ অর্থাৎ কোনো
          ইউজার যখন কোনো ওয়েব পেজে জাভাস্ক্রিপ্ট রান করাবে তখন তা শুধুমাত্র সেই
          ব্রাউজারেই এক্সিকিউট হয়ে যাবে । সার্ভারের সাথে কোনো যোগাযোগ নাই ।
          অর্থাৎ ইউজারের কোনো তথ্যই সার্ভারে পৌছবে না । ওয়েব পেজ রিলোড করার সাথে
          সাথেই তা নষ্ট হয়ে যাবে ।<br />
          <br />
          <strong>নোড জে এস</strong> <br /> নোড জে এস হলো জাভাস্ক্রিপ্ট এর একটি
          রান টাইম। নোড জে এস সার্ভার এ রান করতে পারে । যার কারণে আমরা এখন
          জাভাস্ক্রিপ্ট দিয়ে সার্ভার সাইট এ কাজ করতে পারি
        </p>
        <h2>#2 এসকিউএল এবং নো এসকিউএল ডাটাবেসের এর মধ্যে পার্থক্য কি?</h2>
        <p>
          আমরা জানি এসকিউএল এবং নো এসকিউএল ডাটাবেস দুটাই তথ্য সংরক্ষণ এর জন্য
          ব্যবহার করা হয় তবে এসকিউএল এবং নো এসকিউএল ডাটাবেস এর মধ্যে কিছু
          পার্থক্ষ আছে
        </p>
        <p>
          <strong>এসকিউএল</strong> <br /> এসকিউএল ডাটাবেস হলো একটি রিলেশনাল
          ডাটাবেস। রিলেশনাল ডাটাবেস মানে রিলেশনাল ডাটাবেস ডাটা গুলো টেবিল আকারে
          থাকে। আর এই টেবিল গুলো একটা আর একটি টেবিল আর ডাটার সাথে রিলেশন তৈরী
          করতে পারে । এতে করে ডাটা গুলো অনেক সহজে ম্যানেজ করা যাই
        </p>
        <p>
          <strong>নো এসকিউএল</strong>   <br />নো এসকিউএল ডাটাবেস হলো একটি নন রিলেশনাল ডাটাবেস। নাম শুনেই
          বুঝা যাচ্ছে যে নো এসকিউএল ডাটাবেস অন্য কোনো ডাটার সাথে সম্পর্ক করতে
          পারে না । নো এসকিউএল ডাটাবেস মূলত ডাটা গুলো অবজেক্ট আকারে থাকে যেখানে
          এসকিউএল ডাটাবেস ডাটা টেবিল আকারে থাকে। ডাটা গুলো অবজেক্ট আকারে থাকার
          কারণে এই ডাটা গুলা ম্যানেজ করা একটু কষ্টকর।
        </p>
      </div>
    );
};

export default Blogs;